In [ ]:
#in a module there can be any number of classes or any number of functions etc.
import Twoclassmodule as tc
x=tc.mylist(3)
s=x.sum()

In [ ]:
print(s)

In [ ]:
x.display()

In [ ]:
n=tc.mynumber(6)
a=n.factorial()
print(a)

In [ ]:
#Using from statement you can import only a component(class etc.) of a module
from Twoclassmodule import mylist
x=mylist(3)

In [ ]:
x.display()

In [ ]:
x.max()

In [ ]:
n=mynumber(5)

In [ ]:
from Twoclassmodule import *
n=mynumber(5)

In [ ]:
n.isprime()

In [1]:
#In python, you can not use same function name more than once in a class
import Twoclassmodule as tc
a=tc.multi(5,7)
print(a)

35

In [4]:
from Twoclassmodule import multi
x=multi(5,4)
print(x)

20

In [5]:
import pandas as pd
df=pd.read_csv("D:\\Big Data Analytics\\Online\\03sep.csv")
print(df)

     Name      Age    Marks
0    Ravi       70        ?
1   Mohan  Missing       23
2   Shyam       80  Missing
3     Icy        ?       21
4  Saumya       90       20

In [6]:
#print first 5 rows
df.head()

     Name      Age    Marks
0    Ravi       70        ?
1   Mohan  Missing       23
2   Shyam       80  Missing
3     Icy        ?       21
4  Saumya       90       20

In [7]:
df.tail()

     Name      Age    Marks
0    Ravi       70        ?
1   Mohan  Missing       23
2   Shyam       80  Missing
3     Icy        ?       21
4  Saumya       90       20

In [9]:
df.sample(4)

    Name      Age    Marks
2  Shyam       80  Missing
1  Mohan  Missing       23
0   Ravi       70        ?
3    Icy        ?       21

In [10]:
df.shape

(5, 3)

In [11]:
#General information about data frame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
Name     5 non-null object
Age      5 non-null object
Marks    5 non-null object
dtypes: object(3)
memory usage: 200.0+ bytes

In [12]:
#Addition of new Rows
df1=pd.DataFrame([["Vivek",23,65],["Akriti",21,78]],columns=['Name','Age','Marks'])
df=df.append(df1)
print(df)

     Name      Age    Marks
0    Ravi       70        ?
1   Mohan  Missing       23
2   Shyam       80  Missing
3     Icy        ?       21
4  Saumya       90       20
0   Vivek       23       65
1  Akriti       21       78

In [13]:
#Delete Rows
df.drop(0,inplace=True)
print(df)

     Name      Age    Marks
1   Mohan  Missing       23
2   Shyam       80  Missing
3     Icy        ?       21
4  Saumya       90       20
1  Akriti       21       78

In [14]:
#Add Column
new_data=['Lucknow','Mumbai','Delhi','Delhi','Lucknow']
df.insert(2, column='City',value=new_data)
print(df)

     Name      Age     City    Marks
1   Mohan  Missing  Lucknow       23
2   Shyam       80   Mumbai  Missing
3     Icy        ?    Delhi       21
4  Saumya       90    Delhi       20
1  Akriti       21  Lucknow       78

In [15]:
#Delete a column
del df['City']
print(df)

     Name      Age    Marks
1   Mohan  Missing       23
2   Shyam       80  Missing
3     Icy        ?       21
4  Saumya       90       20
1  Akriti       21       78

In [16]:
#it is not showing any nulll data
print(df.isnull().sum())

Name     0
Age      0
Marks    0
dtype: int64

In [19]:
#Our data may contain any name for null values for ex: missing,?,NULL
import pandas as pd
df=pd.read_csv("D:\\Big Data Analytics\\Online\\03sep.csv",na_values=['Missing','?'])
print(df)

     Name   Age  Marks
0    Ravi  70.0    NaN
1   Mohan   NaN   23.0
2   Shyam  80.0    NaN
3     Icy   NaN   21.0
4  Saumya  90.0   20.0

In [20]:
print(df.isnull())

    Name    Age  Marks
0  False  False   True
1  False   True  False
2  False  False   True
3  False   True  False
4  False  False  False

In [21]:
print(df['Marks'].isnull().sum())

2

In [22]:
print(df.isnull().sum())

Name     0
Age      2
Marks    2
dtype: int64

In [24]:
df = df.sort_values('Name')
print(df)

     Name   Age  Marks
3     Icy   NaN   21.0
1   Mohan   NaN   23.0
0    Ravi  70.0    NaN
4  Saumya  90.0   20.0
2   Shyam  80.0    NaN

In [25]:
#Handling Null Values
#simple way is to remove rows which contain null values

df.dropna(inplace=True)
print(df)

     Name   Age  Marks
4  Saumya  90.0   20.0

In [ ]:
#80% data removed because of NULL value rows removal
#absolutely wrong way of handling null value for this example
#this can be gud way incase number of rows(samples) is very large and null value rows are very small

In [26]:
#Handling Null Values
#simple way is to remove columns which contain null values
import pandas as pd
df=pd.read_csv("D:\\Big Data Analytics\\Online\\03sep.csv",na_values=['Missing','?'])

df.dropna(axis=1,inplace=True)
print(df)

     Name
0    Ravi
1   Mohan
2   Shyam
3     Icy
4  Saumya

In [34]:
#Handling Null Values
#For Numerical Columns
#simple way is to fill missing values with mean value
import pandas as pd
df=pd.read_csv("D:\\Big Data Analytics\\Online\\03sep.csv",na_values=['Missing','?'])
m=df['Marks'].mean()
print(m)

80.0

In [35]:
#fillna function replaces null value with any value for ex:m in this case
df['Marks'].fillna(m,inplace=True)
print(df)

     Name  Marks   Age     City
0    Ravi   70.0   NaN  Lucknow
1   Mohan   80.0  23.0      NaN
2   Shyam   80.0   NaN      NaN
3     Icy   80.0  21.0    Delhi
4  Saumya   90.0  20.0  Lucknow

In [36]:
m=df['Age'].mean()
df['Age'].fillna(m,inplace=True)
print(df)

     Name  Marks        Age     City
0    Ravi   70.0  21.333333  Lucknow
1   Mohan   80.0  23.000000      NaN
2   Shyam   80.0  21.333333      NaN
3     Icy   80.0  21.000000    Delhi
4  Saumya   90.0  20.000000  Lucknow

In [40]:
#For Categorical Columns: 
#Count the occurrence/frequency of each value
df['City'].value_counts()

Lucknow    4
Delhi      1
Name: City, dtype: int64

In [39]:
#Whatever has come maximum number of times, we fill nulll data
#with that value
df['City'].fillna('Lucknow',inplace=True)
print(df)

     Name  Marks        Age     City
0    Ravi   70.0  21.333333  Lucknow
1   Mohan   80.0  23.000000  Lucknow
2   Shyam   80.0  21.333333  Lucknow
3     Icy   80.0  21.000000    Delhi
4  Saumya   90.0  20.000000  Lucknow

In [41]:
df.describe()

           Marks        Age
count   5.000000   5.000000
mean   80.000000  21.333333
std     7.071068   1.080123
min    70.000000  20.000000
25%    80.000000  21.000000
50%    80.000000  21.333333
75%    80.000000  21.333333
max    90.000000  23.000000

In [42]:
#similar to that Select operation in SQl
#access some data out of entire data frame depending on some condition
a=df.loc[df['Name']=='Ravi']
print(a)

   Name  Marks        Age     City
0  Ravi   70.0  21.333333  Lucknow

In [44]:
a=df.loc[df['City']=='Lucknow']
print(a)

     Name  Marks        Age     City
0    Ravi   70.0  21.333333  Lucknow
1   Mohan   80.0  23.000000  Lucknow
2   Shyam   80.0  21.333333  Lucknow
4  Saumya   90.0  20.000000  Lucknow

In [46]:
print(df.iloc[2:,2:])

         Age     City
2  21.333333  Lucknow
3  21.000000    Delhi
4  20.000000  Lucknow